read_verilog -sv  examples/masm/accum.sv;
proc;
opt_clean;
write_verilog examples/masm/out/accum.out.sv;
write_rtlil examples/masm/out/accum.out.rtlil;